## DataFrame

![](img/114.png)

![](img/115.png)

![](img/116.png)

![](img/117.png)

In [1]:
import numpy as np
import pandas as pd

In [2]:
retail_df = pd.read_csv('data/retail/retail_2016_2017.csv')
retail_df

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

Task<br><br>
- I need some help analyzing our transactions to make sure there aren’t any irregularities in the numbers. The data is stored in data/retail/transactions.csv
- Can you read this data in and remind me how many rows are in the data, which columns are in the data, and their datatypes? Mor

In [6]:
transaction_df = pd.read_csv('data/retail/transactions.csv')
transaction_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [8]:
transaction_df.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

## Exploring a DataFrame

![](img/120.png)

![](img/121.png)

![](img/122.png)

![](img/123.png)

![](img/124.png)

![](img/125.png)

![](img/126.png)

Task <br>
- Can you dive a bit more deeply into the retail data and check if there are any missing values?
- What about the number of unique dates? I want to make sure we didn’t leave any out.
- Finally, can you report the mean, median, min and max of “transactions”? I want to check for any anomalies in our data.-

In [9]:
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [10]:
transaction_df.describe(include='all').round(2)

              date  store_nbr  transactions
count        83488   83488.00      83488.00
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN      26.94       1694.60
std            NaN      15.61        963.29
min            NaN       1.00          5.00
25%            NaN      13.00       1046.00
50%            NaN      27.00       1393.00
75%            NaN      40.00       2079.00
max            NaN      54.00       8359.00

In [12]:
transaction_df.columns = ["date", "store number", "transactions"]
transaction_df.head()

         date  store number  transactions
0  2013-01-01            25           770
1  2013-01-02             1          2111
2  2013-01-02             2          2358
3  2013-01-02             3          3487
4  2013-01-02             4          1922

In [17]:
# transaction_df.store_number
transaction_df["store number"]

0        25
1         1
2         2
3         3
4         4
         ..
83483    50
83484    51
83485    52
83486    53
83487    54
Name: store number, Length: 83488, dtype: int64

## Accessing DataFrame

![](img/129.png)

![](img/130.png)

![](img/131.png)

![](img/132.png)

![](img/133.png)

![](img/134.png)

![](img/135.png)

![](img/136.png)

In [18]:
transaction_df = pd.read_csv('data/retail/transactions.csv')
transaction_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

Task <br>
- Can you get me a copy of the DataFrame that excludes first row, and only includes “store_nbr” and “transactions”?
- Also, can you report the number of unique store numbers? 
- Finally, report the total number of transactions in millions.

In [20]:
transaction_df.loc[1:, ["store_nbr", "transactions"]]

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [22]:
transaction_df["store_nbr"].nunique()

54

In [23]:
transaction_df["transactions"].sum()

141478945

## Dropping Data

![](img/139.png)

![](img/140.png)

![](img/141.png)

![](img/142.png)

![](img/143.png)

![](img/144.png)

![](img/145.png)

Task <br>
- Can you drop the first row of data this time? A slice is fine for viewing but we want this permanently removed. 
- Also, drop the date column, but not in place.
- Then, can you get me a DataFrame that includes only the last row for each of our stores? I want to take a look at the most recent data for each.

In [ ]:
retail_df.drop(range(1), axis=0, inplace=True).head()
retail_df.drop(subset='date')
retail_df.drop_duplicates(keep="last", ignore_index=True)

In [ ]:
tran.drop([0], axis=0, inplace=True).head()
tran.drop("date", axis=1).head()
tran.drop_duplicates(subset = 'store_nbr', keep="last", ignore_index = True)

## Handling Missing Data

![](img/148.png)

![](img/149.png)

Task # oil data - 'data/retail/oil.csv'
- Can you tell if any dates or prices are missing?
- I’d like to see the mean oil price if we fill in the missing values with 0 
- compare it to the mean oil price if we fill them in with the mean.

In [25]:
oil_df = pd.read_csv('data/retail/oil.csv')
oil_df

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [26]:
oil_df.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [30]:
oil_df["dcoilwtico"].fillna(0).mean()

65.32379310344828

In [31]:
oil_df["dcoilwtico"].fillna(oil_df["dcoilwtico"].mean()).mean()

67.71436595744682

## Sorting & Filtering

![](img/152.png)

![](img/153.png)

![](img/154.png)

![](img/155.png)

![](img/156.png)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- First, calculate the percentage of times ALL stores had more than 2000 transactions
- Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
- Finally, sum the transactions for stores 25 and 3, that occurred in May or June, and had less than 2000 transactions

![](img/159.png)

![](img/160.png)

![](img/161.png)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
- Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
- Finally, sort the columns in reverse alphabetical order.

## Modifying Columns

![](img/164.png)

![](img/165.png)

![](img/166.png)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- Can you send me the transaction data with the columns renamed? 
    - transactions -> transaction_count, store_nbr -> store_number
- I want them looking a bit prettier for my presentation – you can find more details in the notebook.
Also, could you reorder the columns so date is first, then transaction count, then store number?

![](img/169.png)

![](img/170.png)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>

- Create a ‘pct_to_target’ column that divides transactions by 2500 – our transaction target for all stores. Then create a ‘met_target’ column that is True if ‘pct_to_target’ is greater than or equal to 1, and False if not. Finally, create a ‘bonus_payable’ column that equals 100 if ‘met_target’ is True, and 0 if not, then sum the total ‘bonus_payable’ amount.
- Finally, create columns for month and day of week as integers. I put some code for the date parts in the notebook.

![](img/173.png)

### Mapping values to columns

![](img/176.png)

![](img/177.png)

![](img/178.png)

![](img/179.png)

![](img/180.png)

![](img/181.png)

![](img/182.png)

![](img/183.png)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- Drop the columns that have been created so far (keep only date, store_number, and transaction count), and recreate them using the assign method.
- Then sum the seasonal bonus owed once again to make sure the numbers are correct.

## Review Data Types

![](img/186.png)

![](img/187.png)

![](img/188.png)

![](img/189.png)

### Memory Optimization

![](img/190.png)

![](img/191.png)

![](img/192.png)

![](img/193.png)

![](img/194.png)

![](img/195.png)

![](img/196.png)

![](img/197.png)

![](img/198.png)

![](img/199.png)

Task *Dataset: 'data/retail/transactions.csv'*
- We have a very, very old computer, so do you think you can reduce the memory usage to below 5MB, without losing any of the information?